package com.streamlite.broker;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.scheduling.annotation.EnableAsync;

@EnableAsync
@SpringBootApplication
public class BrokerApplication {

	public static void main(String[] args) {
		SpringApplication.run(BrokerApplication.class, args);
		System.out.println("🚀🚀🚀 Welcome to Streamgres Broker --- Event Streaming Platform 🚀🚀🚀");
		System.out.println("""
				
				░██████╗████████╗██████╗░███████╗░█████╗░███╗░░░███╗░██████╗░██████╗░███████╗░██████╗
				██╔════╝╚══██╔══╝██╔══██╗██╔════╝██╔══██╗████╗░████║██╔════╝░██╔══██╗██╔════╝██╔════╝
				╚█████╗░░░░██║░░░██████╔╝█████╗░░███████║██╔████╔██║██║░░██╗░██████╔╝█████╗░░╚█████╗░
				░╚═══██╗░░░██║░░░██╔══██╗██╔══╝░░██╔══██║██║╚██╔╝██║██║░░╚██╗██╔══██╗██╔══╝░░░╚═══██╗
				██████╔╝░░░██║░░░██║░░██║███████╗██║░░██║██║░╚═╝░██║╚██████╔╝██║░░██║███████╗██████╔╝
				╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝╚═╝░░░░░╚═╝░╚═════╝░╚═╝░░╚═╝╚══════╝╚═════╝░
				""");
	}

}
